app/controllers/movies_controller.rb

INSERT INTO "movies" ("name", "release_year", "genre", "description", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "name" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["name", "Interstellar1"], ["updated_at", "2021-03-19 13:26:42.061324"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)